Connected to MySQL

In [64]:
import mysql.connector

config = {
  'user': 'root',
  'password': 'root',
  'host': 'localhost',
  'database': 'learning_sql_database',
  'raise_on_warnings': True,
}

link = mysql.connector.connect(**config, buffered=True)

In [13]:
mycursor =  link.cursor()
mycursor.execute(
"""CREATE TABLE sql_lesson_1_movies
(
    Id INT PRIMARY KEY UNIQUE,
    Title VARCHAR(50),
    Director VARCHAR(50),
    Year INT,
    Length_minutes INT)"""
)

In [54]:
mycursor = link.cursor()

sql = "INSERT INTO sql_lesson_1_movies (Id, Title, Director, Year, Length_minutes) VALUES (%s, %s, %s, %s, %s)"
val = (1, "Toy Story", "John Lasseter", 1995, 81)

mycursor.execute(sql, val)

link.commit()
print(mycursor.rowcount, 'record(s) inserted.')

In [68]:
mycursor = link.cursor()

sql = "REPLACE INTO sql_lesson_1_movies (Id, Title, Director, Year, Length_minutes) VALUES (%s, %s, %s, %s, %s)"
val = [
    (0, "Toy Story", "John Lasseter", 1995, 81),
    (1, "A Bug's Life", "John Lasseter", 1998, 95),
    (2, "Toy Story 2", "John Lasseter", 1999, 93),
    (3, "Monsters, Inc.", "Pete Docter", 2001, 92),
    (4, "Finding Nemo", "Andrew Stanton", 2003, 107),
    (5, "The Incredibles", "Brad Bird", 2004, 116),
    (6, "Cars", "John Lasseter", 2006, 117),
    (7, "Ratatouille", "Brad Bird", 2007, 115),
    (8, "WALL-E", "Andrew Stanton", 2008, 104),
    (9, "Up", "Pete Docter", 2009, 101)
]

mycursor.executemany(sql, val)

link.commit()
print(mycursor.rowcount, 'record(s) inserted.')

19 record(s) inserted.

In [69]:
import pandas as pd

pd.read_sql_query('SELECT * FROM sql_lesson_1_movies', link)

    Id            Title        Director  Year  Length_minutes
0    0        Toy Story   John Lasseter  1995              81
1    1     A Bug's Life   John Lasseter  1998              95
2    2      Toy Story 2   John Lasseter  1999              93
3    3   Monsters, Inc.     Pete Docter  2001              92
4    4     Finding Nemo  Andrew Stanton  2003             107
5    5  The Incredibles       Brad Bird  2004             116
6    6             Cars   John Lasseter  2006             117
7    7      Ratatouille       Brad Bird  2007             115
8    8           WALL-E  Andrew Stanton  2008             104
9    9               Up     Pete Docter  2009             101
10  10               Up     Pete Docter  2009             101

In [58]:
%sql
%reload_ext sql

 * sqlite://

In [63]:
%sql sqlite://root:haraka@root/learning_sql_database

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys(['sqlite://'])
Invalid SQLite URL: sqlite://root:haraka@root/learning_sql_database
Valid SQLite URL forms are:
 sqlite:///:memory: (or, sqlite://)
 sqlite:///relative/path/to/file.db
 sqlite:////absolute/path/to/file.db
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys(['sqlite://'])